{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "mixed_float16"
          },
          "registered_name": null
        },
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batchInputShape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "units": 384,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "rate": 0.4,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "mixed_float16"
                },
                "registered_name": null
              },
              "units": 4,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [null, 224, 224, 3]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "loss_weights": null,
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": true,
      "optimizer_config": {
        "class_name": "LossScaleOptimizer",
        "config": {
          "name": "loss_scale_optimizer",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "inner_optimizer": {
            "module": "keras.optimizers",
            "class_name": "Adam",
            "config": {
              "name": "adam",
              "learning_rate": 9.999999747378752e-06,
              "weight_decay": null,
              "clipnorm": null,
              "global_clipnorm": null,
              "clipvalue": null,
              "use_ema": false,
              "ema_momentum": 0.99,
              "ema_overwrite_frequency": null,
              "beta_1": 0.9,
              "beta_2": 0.999,
              "epsilon": 1e-07,
              "amsgrad": false
            },
            "registered_name": null
          },
          "initial_scale": 32768.0,
          "dynamic_growth_steps": 2000
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of32.bin",
        "group1-shard2of32.bin",
        "group1-shard3of32.bin",
        "group1-shard4of32.bin",
        "group1-shard5of32.bin",
        "group1-shard6of32.bin",
        "group1-shard7of32.bin",
        "group1-shard8of32.bin",
        "group1-shard9of32.bin",
        "group1-shard10of32.bin",
        "group1-shard11of32.bin",
        "group1-shard12of32.bin",
        "group1-shard13of32.bin",
        "group1-shard14of32.bin",
        "group1-shard15of32.bin",
        "group1-shard16of32.bin",
        "group1-shard17of32.bin",
        "group1-shard18of32.bin",
        "group1-shard19of32.bin",
        "group1-shard20of32.bin",
        "group1-shard21of32.bin",
        "group1-shard22of32.bin",
        "group1-shard23of32.bin",
        "group1-shard24of32.bin",
        "group1-shard25of32.bin",
        "group1-shard26of32.bin",
        "group1-shard27of32.bin",
        "group1-shard28of32.bin",
        "group1-shard29of32.bin",
        "group1-shard30of32.bin",
        "group1-shard31of32.bin",
        "group1-shard32of32.bin"
      ],
      "weights": [
        {
          "name": "sequential/conv2d/kernel",
          "shape": [3, 3, 3, 64],
          "dtype": "float32"
        },
        {
          "name": "sequential/conv2d/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "sequential/conv2d_1/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "sequential/conv2d_1/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "sequential/conv2d_2/kernel",
          "shape": [3, 3, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "sequential/conv2d_2/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense/kernel",
          "shape": [86528, 384],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense/bias",
          "shape": [384],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_1/kernel",
          "shape": [384, 4],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_1/bias",
          "shape": [4],
          "dtype": "float32"
        }
      ]
    }
  ]
}
